### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.postgres_snet.dx_available_subnet_cidr.next_cidr will be created
  + resource "dx_available_subnet_cidr" "next_cidr" {
      + cidr_block         = (known after apply)
      + id                 = (known after apply)
      + prefix_length      = 24
      + virtual_network_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01"
    }

  # module.postgres_snet.module.pgres_snet.azurerm_subnet.this will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                              = (known after apply)
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "io-p-itn-svc-pgres-snet-01"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "io-p-itn-common-rg-01"
      + virtual_network_name                          = "io-p-itn-common-vnet-01"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>
